Нужно придумать небольшую базу данных и написать к ней запросы.

В базе должно быть минимум 4 таблицы и хотя бы две связи вида one-to-many или many-to-many. Можно решить как при помощи pandas, так и при помощи SQL.

Запросы должны быть осмысленными и должны решать какую-то задачу.

### Easy
Выгрузить данные и отфильтровать их по какому-то значению.

### Normal
Написать запрос на объединение двух или более таблиц, также в запросе должна быть фильтрация

### Hard
Написать запрос, который посчитает какую-то сложную аналитику по БД, используя как можно больше таблиц. Построить графики и сделать выводы.

## Easy

In [1]:
import sqlite3
import pandas as pd

In [2]:
sql = sqlite3.connect('../data/workers.db')

In [3]:
# Таблица с должностями
work = ["Директор", "Заместитель директора", "Программист", "Уборщица", "Водитель"]
work_df = pd.DataFrame({'work': work})
work_df

work_df.to_sql('work', sql, index_label="id", if_exists='replace')
pd.read_sql("SELECT * FROM work", sql)

   id                   work
0   0               Директор
1   1  Заместитель директора
2   2            Программист
3   3               Уборщица
4   4               Водитель

In [4]:
# Таблица с образованием
skills = ["нет", "среднее", "среднее специальное", "высшее", "кандидат наук"]
skills_df = pd.DataFrame({'skills': skills})

skills_df.to_sql('skills', sql, index_label="id", if_exists='replace')
pd.read_sql("SELECT * FROM skills", sql)

   id               skills
0   0                  нет
1   1              среднее
2   2  среднее специальное
3   3               высшее
4   4        кандидат наук

In [5]:
# Таблица с семейным положением
status = ["женат / жената", "разведен / разведена", "не женат / не замужем"]
status_df = pd.DataFrame({'status': status})

status_df.to_sql('status', sql, index_label="id", if_exists='replace')
pd.read_sql("SELECT * FROM status", sql)

   id                 status
0   0         женат / жената
1   1   разведен / разведена
2   2  не женат / не замужем

In [6]:
fio = ['Овчинникова Антонина Демидовна', "Васильев Владимир Андреевич", "Павлов Тимофей Алексеевич", "Ковалева Таисия Романовна",
         "Марков Владимир Тимофеевич", "Петров Артём Вячеславович", 'Горбунова Варвара Фёдоровна', 'Блинова Злата Арсеновна']
work_id = [1, 1, 2, 2, 2, 3, 3, 4]
status_id = [1, 0, 2, 2, 1, 2, 2, 2]
skils_id = [1, 2, 1, 3, 4, 4, 3, 2]
phone = ['#670', '#540', '#460', '#799', '#480', '#650', '#570', '#518']

job_df = pd.DataFrame({
    'fio': fio,
    'work_id': work_id,
    'status_id': status_id,
    'skils_id': skils_id,
    'phone': phone
})

job_df.to_sql('job', sql, index_label="id", if_exists='replace')

In [7]:
pd.read_sql("SELECT * FROM job WHERE status_id = '2'", sql)

   id                          fio  work_id  status_id  skils_id phone
0   2    Павлов Тимофей Алексеевич        2          2         1  #460
1   3    Ковалева Таисия Романовна        2          2         3  #799
2   5    Петров Артём Вячеславович        3          2         4  #650
3   6  Горбунова Варвара Фёдоровна        3          2         3  #570
4   7      Блинова Злата Арсеновна        4          2         2  #518

## Normal

In [16]:
query = ("""
SELECT fio, phone, status, skils_id 
FROM job 
LEFT JOIN status ON job.status_id = status.id
""")


pd.read_sql(query, sql)

                              fio phone                 status  skils_id
0  Овчинникова Антонина Демидовна  #670   разведен / разведена         1
1     Васильев Владимир Андреевич  #540         женат / жената         2
2       Павлов Тимофей Алексеевич  #460  не женат / не замужем         1
3       Ковалева Таисия Романовна  #799  не женат / не замужем         3
4      Марков Владимир Тимофеевич  #480   разведен / разведена         4
5       Петров Артём Вячеславович  #650  не женат / не замужем         4
6     Горбунова Варвара Фёдоровна  #570  не женат / не замужем         3
7         Блинова Злата Арсеновна  #518  не женат / не замужем         2

## Hard